Revit 2027 API
IFCData.CreateIFCAggregate Method
 Creates an IFCAggregate data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateIFCAggregate(
	IFCAggregate value
)
Public Shared Function CreateIFCAggregate (
	value As IFCAggregate
) As IFCData
public:
static IFCData^ CreateIFCAggregate(
	IFCAggregate^ value
)
static member CreateIFCAggregate :
        value : IFCAggregate -> IFCData
Parameters
value IFCAggregate
 The IFCAggregate value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace